# 微实例3.2.1数字类型的运算
a = 100 / 3  # 整数与整数的运算为小数，即为浮点数
print("{}".format(a))
b = 100 // 3  # 整数与整整数的运算为整数，即为整数
print("{}".format(b))
c = 123 + 4.0  # 整数与浮点数之间的运算输出为浮点数
print("{}".format(c))
d = 10.0 - 1 + 2j  # 等价于（10.0-1）+2j，浮点数与复数的运算输出为复数
print("{}".format(d))
# 可以看出是整数->浮点数->复数的逐渐扩展关系
# x+y表示x与y的和
# x-y表示x与y的差
# x*y表示x与y的积
# x/y表示x与y的商
# x//y表示x与y的整数商
# x%y表示x与y之商的余数，也称为模运算，本质上，整数的模运算可以将x映射到到[0,y-1]的区间内
# -x表示x的负数，即x*(-1)
# +x表示x本身
# x**y表示为幂运算，即x的y次方
# 所有的二元数学操作符都有其增强赋值操作符，用op表示二元数学操作符，则x op= y等价于x = x op y
x = 3.141582653
x **= 3  # 等价于x = x ** 3
print("{}".format(x))
